src/cf/Reports/СоставПалитры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>СоставПалитры</Name>
		</Properties>
	</Report>
</MetaDataObject>

src/cf/Enums/ВидыМодификаторовРМК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыМодификаторовРМК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВключатьВЧек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВключатьВЧек</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ПалитраТоваровРМК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПалитраТоваровРМК</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоЭлементовВРяду</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаЭлемента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоРядов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШрифтЭлементовПодбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникЗаполнения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсточникЗаполненияПалитрыРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныйВидНоменклатуры</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВидНоменклатурыРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебнаяОсобенностьУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОсобенностиУчетаНоменклатурыРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьЦену</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодпискаНаНоменклатуру</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеПодписки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФонаКнопки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФонаПапки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭтоКатегория</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКатегории</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКатегорииРазмещения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндексПозиции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяЭлемента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НоменклатураРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаголовокЭлемента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзображениеЭлемента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПалитраТоваровРМКПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикиИспользуются</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шрифт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦветШрифта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦветФона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КатегорияРазмещения</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.АльтернативнаяГруппировкаИзбранныхТоваровРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмеетсяВложенность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидМодификатора</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыМодификаторовРМК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УпаковкаРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкрыватьОстаток</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Палитра</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПалитраТоваровРМК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПустаяОбласть</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КартинкаПоУмолчанию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Reports/СоставПалитры/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяВариантаСЦеной = "СЦенами";
	Если Параметры.Свойство("Палитра") И ЗначениеЗаполнено(Параметры.Палитра) Тогда
		ОбщегоНазначенияРМК.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
		НастроитьПервоначальноеЗаполнение();
		ВосстановитьНастройкиКолонок();
		ЗаполнитьНаборПалитр();
		Если СформироватьПриЗапуске Тогда
			СформироватьНаСервере();
		КонецЕсли;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	СохранитьНастройкиКолонокПриНеобходимости();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТекущийВариантПриИзменении(Элемент)
	
	ОбработатьИзменениеВариантаОтчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийВариантОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеОтчетаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	Если ТипЗнч(Расшифровка) = Тип("СправочникСсылка.ПалитраТоваровРМКПрисоединенныеФайлы") Тогда
		
		ДанныеФайла = РаботаСФайламиКлиент.ДанныеФайла(Расшифровка, УникальныйИдентификатор);
		РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);
		СтандартнаяОбработка = Ложь
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастраиваемыеКолонкиПриИзменении(Элемент)
	МодифицированностьНастроек = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СохранятьНастройкиКолонокПриИзменении(Элемент)
	МодифицированностьНастроек = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	СохранитьНастройкиКолонокПриНеобходимости();
	РезультатПроверки = ПараметрыОтчетаЗаполнены(ЭтотОбъект);
	
	Если РезультатПроверки.Успех Тогда
		СформироватьНаСервере();
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатПроверки.ТекстОшибки, , РезультатПроверки.ПолеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьСоставКолонок(Команда)
	
	Элементы.ГруппаНастройкаКолонок.Показать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПараметрыОтчетаЗаполнены(Форма)
	
	РезультатФункции = Новый Структура("Успех,ТекстОшибки,ПолеОшибки", Истина, "", "");
	
	Если Форма.ТекущийВариант = Форма.ИмяВариантаСЦеной Тогда
		ТекстОшибки = "";
		ПолеОшибки = "";
		Если Не ЗначениеЗаполнено(Форма.ДатаОтчета) Тогда
			ТекстОшибки = НСтр("ru = 'Не заполнена ""Дата отчета"".'");
			ПолеОшибки = "ДатаОтчета";
		Иначе
			КоличествоПараметров = Форма.ПараметрыЗапросаЦен.Количество();
			ИндексПараметра = 0;
			Пока ИндексПараметра < КоличествоПараметров И ТекстОшибки = "" Цикл
				ПараметрЗапросаЦен = Форма.ПараметрыЗапросаЦен.Получить(ИндексПараметра);
				Если Не ЗначениеЗаполнено(Форма[ПараметрЗапросаЦен.Значение]) Тогда
					ТекстОшибки = СтрШаблон(НСтр("ru = 'Не заполнен параметр ""%1"".'"), ПараметрЗапросаЦен.Представление);
					ПолеОшибки = ПараметрЗапросаЦен.Значение;
				КонецЕсли;
				ИндексПараметра = ИндексПараметра + 1;
			КонецЦикла;
		КонецЕсли;
		Если Не ТекстОшибки = "" Тогда
			РезультатФункции.Успех = Ложь;
			РезультатФункции.ТекстОшибки = ТекстОшибки;
			РезультатФункции.ПолеОшибки = ПолеОшибки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьИзменениеВариантаОтчета()
	
	Элементы.ГруппаВариантСЦеной.Видимость = (ТекущийВариант = ИмяВариантаСЦеной);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	ОбластиМакета = Новый Структура();
	МакетОтчета = Отчеты.СоставПалитры.ПолучитьМакет("СоставПалитры");
	ОбластьШапкаЭлемент = МакетОтчета.ПолучитьОбласть("шапка|Элемент");
	ОбластьШапкаЦена = МакетОтчета.ПолучитьОбласть("шапка|Цена");
	ОбластиМакета.Вставить("РядЭлемент", МакетОтчета.ПолучитьОбласть("ряд|Элемент"));
	ОбластиМакета.Вставить("РядЦена", МакетОтчета.ПолучитьОбласть("ряд|Цена"));
	
	ДанныеПоПалитре = ПодготовитьДанныеПоПалитре();
	
	ПолеОтчета.Очистить();
	ОбластьШапкаЭлемент.Параметры.Палитра = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Палитра, "Наименование");
	ПолеОтчета.Вывести(ОбластьШапкаЭлемент);
	
	ОбластиКолонок = Новый Соответствие;
	Для Каждого КолонкаОтчета Из НастраиваемыеКолонки Цикл
		Если КолонкаОтчета.Пометка Тогда
			ОбластьКолонкиШапка = МакетОтчета.ПолучитьОбласть(СтрШаблон("шапка|%1", КолонкаОтчета.Значение));
			ПолеОтчета.Присоединить(ОбластьКолонкиШапка);
			ОбластьКолонкиРяд = МакетОтчета.ПолучитьОбласть(СтрШаблон("ряд|%1", КолонкаОтчета.Значение));
			ОбластиКолонок.Вставить(КолонкаОтчета.Значение, ОбластьКолонкиРяд);
		КонецЕсли;
	КонецЦикла;
	ОбластиМакета.Вставить("ОбластиКолонок", ОбластиКолонок);
	
	Если ТекущийВариант = ИмяВариантаСЦеной Тогда
		ПолеОтчета.Присоединить(ОбластьШапкаЦена);
	КонецЕсли;
	
	ПолеОтчета.НачатьАвтогруппировкуСтрок();
	ОбойтиСтрокиУровня(ДанныеПоПалитре, ОбластиМакета, Палитра, 0, 0);
	ПолеОтчета.ЗакончитьАвтогруппировкуСтрок();
	ПолеОтчета.ФиксацияСверху = 4;
	ПолеОтчета.ФиксацияСлева = 2;
	
КонецПроцедуры

&НаСервере
Процедура ОбойтиСтрокиУровня(ДанныеПоПалитре, ОбластиМакета, ПалитраОбхода, НомерКатегории, Знач Уровень)
	
	ОтступКартинки = 5.9;
	
	НачалоИмениКолонкиЦвета = "Цвет";
	ИмяКолонкиИзображение = "Изображение";
	
	ОтборСтрок = Новый Структура("Палитра,НомерКатегорииРазмещения", ПалитраОбхода, НомерКатегории);
	СтрокиУровня = ДанныеПоПалитре.СтрокиПалитры.НайтиСтроки(ОтборСтрок);
	ЖирныйШрифт = Неопределено;
	ПростоШрифт = Неопределено;
	ЦветаСтроки = Новый Структура("ЦветФона,ЦветШрифта", Неопределено, Неопределено);
	Для Каждого СтрокаУровня Из СтрокиУровня Цикл
		
		ОбластиМакета.РядЭлемент.Параметры.ИмяЭлемента = СтрокаУровня.ИмяЭлемента;
		ОбластиМакета.РядЭлемент.Рисунки.Иконка.Картинка = ПолучитьИконкуСтрокиПалитры(СтрокаУровня);
		ОбластиМакета.РядЭлемент.Рисунки.Иконка.Лево = ОтступКартинки + ОтступКартинки * Уровень;
		ОбластьДобавления = ПолеОтчета.Вывести(ОбластиМакета.РядЭлемент, Уровень);
		Если ЖирныйШрифт = Неопределено Тогда
			ПростоШрифт = ОбластиМакета.РядЭлемент.ПолучитьОбласть("C2").ТекущаяОбласть.Шрифт;
			ЖирныйШрифт = Новый Шрифт(ПростоШрифт, , , Истина);
		КонецЕсли;
		ОбластьДобавления.Шрифт = ?(СтрокаУровня.ЭтоКатегория, ЖирныйШрифт, ПростоШрифт);
		
		Для Каждого КолонкаОтчета Из НастраиваемыеКолонки Цикл
			Если КолонкаОтчета.Пометка Тогда
				
				ЦветаСтроки.ЦветФона = Неопределено;
				ЦветаСтроки.ЦветШрифта = Неопределено;
				ОбластьКолонки = ОбластиМакета.ОбластиКолонок.Получить(КолонкаОтчета.Значение);
				Если СтрНайти(КолонкаОтчета.Значение, НачалоИмениКолонкиЦвета) = 1 Тогда
					
					ЗаполнитьЦветаСтроки(СтрокаУровня, ОбластьКолонки, ЦветаСтроки, КолонкаОтчета.Значение);
					
				ИначеЕсли КолонкаОтчета.Значение = ИмяКолонкиИзображение И СтрокаУровня.КартинкаПоУмолчанию Тогда
					ОбластьКолонки.Параметры.ИзображениеПредставление = НСтр("ru = '<Картинка по умолчанию>'");
					ОбластьКолонки.Параметры.Изображение = Неопределено;
				Иначе
					ОбластьКолонки.Параметры.Заполнить(СтрокаУровня);
				КонецЕсли;
				ОбластьПрисоединения = ПолеОтчета.Присоединить(ОбластьКолонки);
				Если Не ЦветаСтроки.ЦветФона = Неопределено Тогда
					ОбластьПрисоединения.ЦветФона = ЦветаСтроки.ЦветФона;
				КонецЕсли;
				Если Не ЦветаСтроки.ЦветШрифта = Неопределено Тогда
					ОбластьПрисоединения.ЦветТекста = ЦветаСтроки.ЦветШрифта;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		Если ТекущийВариант = ИмяВариантаСЦеной Тогда
			ОбластиМакета.РядЦена.Параметры.Цена
				= СформироватьПредставлениеЦеныСтрокиПалитры(ДанныеПоПалитре, СтрокаУровня);
			ПолеОтчета.Присоединить(ОбластиМакета.РядЦена);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаУровня.ВложеннаяПалитра) Тогда
			ОбойтиСтрокиУровня(ДанныеПоПалитре, ОбластиМакета, СтрокаУровня.ВложеннаяПалитра, 0, Уровень + 1);
		ИначеЕсли СтрокаУровня.НомерКатегории > 0 Тогда
			ОбойтиСтрокиУровня(ДанныеПоПалитре, ОбластиМакета, ПалитраОбхода, СтрокаУровня.НомерКатегории, Уровень + 1);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СформироватьПредставлениеЦеныСтрокиПалитры(ДанныеПоПалитре, СтрокаПалитры)
	
	ПредставлениеЦены = "";
	Если ЗначениеЗаполнено(СтрокаПалитры.Номенклатура) Тогда
		ЦенаНоменклатуры = 0;
		ОтборСтрок = Новый Структура("Номенклатура", СтрокаПалитры.Номенклатура);
		СтрокиЦен = ДанныеПоПалитре.ЦеныНоменклатуры.НайтиСтроки(ОтборСтрок);
		КоличествоСтрок = СтрокиЦен.Количество();
		ИндексСтроки = 0;
		НуженПоиск = Истина;
		Пока ИндексСтроки < КоличествоСтрок И НуженПоиск Цикл
			СтрокаЦены = СтрокиЦен.Получить(ИндексСтроки);
			Если СтрокаСоответствуетОтборуКолонок(СтрокаПалитры, СтрокаЦены) Тогда
				ЦенаНоменклатуры = СтрокаЦены.Цена;
				НуженПоиск = Ложь;
			КонецЕсли;
			
			ИндексСтроки = ИндексСтроки + 1;
		КонецЦикла;
		ПредставлениеЦены = Формат(ЦенаНоменклатуры, "ЧДЦ=2; ЧН=0.00");
	КонецЕсли;
	Возврат ПредставлениеЦены;
	
КонецФункции

&НаСервере
Функция СтрокаСоответствуетОтборуКолонок(СтрокаПалитры, СтрокаЦены)
	
	КоличествоКолонокОтбора = КолонкиОтбораЦен.Количество();
	РезультатФункции = Истина;

	ИндексКолонки = 0;
	Пока ИндексКолонки < КоличествоКолонокОтбора И РезультатФункции Цикл
		
		КолонкаОтбора = КолонкиОтбораЦен.Получить(ИндексКолонки);
		ИмяКолонки = КолонкаОтбора.Значение;
		Если ЗначениеЗаполнено(СтрокаЦены[ИмяКолонки]) И Не СтрокаЦены[ИмяКолонки] = СтрокаПалитры[ИмяКолонки] Тогда
			РезультатФункции = Ложь;
		КонецЕсли;
		
		ИндексКолонки = ИндексКолонки + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьЦветаСтроки(СтрокаУровня, ОбластьКолонки, ЦветаСтроки, ИмяКолонки)
	
	ПредставлениеЦвета = "";
	Если Не (ЗначениеЗаполнено(СтрокаУровня.ВложеннаяПалитра) Или СтрокаУровня.ПустаяОбласть) Тогда
		
		ЦветФонаСтрокой = СтрокаУровня.ЦветФона;
		ЦветШрифтаСтрокой = СтрокаУровня.ЦветШрифта;
		Если Не ЦветФонаСтрокой = "" Тогда
			ЦветаСтроки.ЦветФона = ОбщегоНазначения.ЗначениеИзСтрокиXML(ЦветФонаСтрокой);
		КонецЕсли;
		Если Не ЦветШрифтаСтрокой = "" Тогда
			ЦветаСтроки.ЦветШрифта = ОбщегоНазначения.ЗначениеИзСтрокиXML(ЦветШрифтаСтрокой);
		КонецЕсли;
		
		ЦветКолонки = Неопределено;
		ЦветаСтроки.Свойство(ИмяКолонки, ЦветКолонки);
		Если Не ЦветКолонки = Неопределено Тогда
			ПредставлениеЦвета = Строка(ЦветКолонки);
		КонецЕсли;
		
	КонецЕсли;
	ОбластьКолонки.Параметры[ИмяКолонки] = ПредставлениеЦвета;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИконкуСтрокиПалитры(СтрокаПалитры)
	
	РезультатФункции = Новый Картинка;
	
	Если ЗначениеЗаполнено(СтрокаПалитры.ВложеннаяПалитра) Тогда
		РезультатФункции = БиблиотекаКартинок.РМКЭлементПалитрыВложеннаяПалитра;
	ИначеЕсли СтрокаПалитры.ЭтоКатегория Тогда
		РезультатФункции = БиблиотекаКартинок.РМКЭлементПалитрыГруппа;
	ИначеЕсли СтрокаПалитры.ВидМодификатора = Перечисления.ВидыМодификаторовРМК.ВключатьВЧек Тогда
		РезультатФункции = БиблиотекаКартинок.РМКЭлементПалитрыМодификаторВЧеке;
	ИначеЕсли СтрокаПалитры.ВидМодификатора = Перечисления.ВидыМодификаторовРМК.НеВключатьВЧек Тогда
		РезультатФункции = БиблиотекаКартинок.РМКЭлементПалитрыМодификаторВнеЧека;
	ИначеЕсли ЗначениеЗаполнено(СтрокаПалитры.Номенклатура) Тогда
		РезультатФункции = БиблиотекаКартинок.РМКЭлементПалитрыТовар;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаСервере
Функция ПодготовитьДанныеПоПалитре()
	
	РезультатФункции = Новый Структура();
	НомерОсновнойТаблицы = 1;
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	ПалитраТоваровРМКСостав.Ссылка КАК Палитра,
	|	ПРЕДСТАВЛЕНИЕ(ПалитраТоваровРМКСостав.Ссылка) КАК ПалитраПредставление,
	|	ПалитраТоваровРМКСостав.НомерСтроки КАК НомерСтроки,
	|	ПалитраТоваровРМКСостав.Палитра КАК ВложеннаяПалитра,
	|	ПалитраТоваровРМКСостав.Номенклатура КАК Номенклатура,
	|	ПРЕДСТАВЛЕНИЕ(ПалитраТоваровРМКСостав.Номенклатура) КАК НоменклатураПредставление,
	|	ПалитраТоваровРМКСостав.Характеристика КАК Характеристика,
	|	ПалитраТоваровРМКСостав.НомерКатегории КАК НомерКатегории,
	|	ПалитраТоваровРМКСостав.НомерКатегорииРазмещения КАК НомерКатегорииРазмещения,
	|	ПалитраТоваровРМКСостав.ЦветШрифта КАК ЦветШрифта,
	|	ПалитраТоваровРМКСостав.ЦветФона КАК ЦветФона,
	|	ПалитраТоваровРМКСостав.ЭтоКатегория КАК ЭтоКатегория,
	|	ВЫБОР
	|		КОГДА ПалитраТоваровРМКСостав.Палитра = ЗНАЧЕНИЕ(Справочник.ПалитраТоваровРМК.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоПалитра,
	|	ПалитраТоваровРМКСостав.ИмяЭлемента КАК ИмяЭлемента,
	|	ПалитраТоваровРМКСостав.ИзображениеЭлемента КАК Изображение,
	|	ЕСТЬNULL(ПалитраТоваровРМКПрисоединенныеФайлы.Представление, """") КАК ИзображениеПредставление,
	|	ПалитраТоваровРМКСостав.ВидМодификатора КАК ВидМодификатора,
	|	ПалитраТоваровРМКСостав.Упаковка КАК Упаковка,
	|	ПалитраТоваровРМКСостав.СкрыватьОстаток КАК СкрыватьОстаток,
	|	ПалитраТоваровРМКСостав.ПустаяОбласть КАК ПустаяОбласть,
	|	ПалитраТоваровРМКСостав.КартинкаПоУмолчанию КАК КартинкаПоУмолчанию
	|ПОМЕСТИТЬ втСтрокиПалитры
	|ИЗ
	|	Справочник.ПалитраТоваровРМК.Состав КАК ПалитраТоваровРМКСостав
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПалитраТоваровРМКПрисоединенныеФайлы КАК ПалитраТоваровРМКПрисоединенныеФайлы
	|		ПО ПалитраТоваровРМКСостав.ИзображениеЭлемента = ПалитраТоваровРМКПрисоединенныеФайлы.Ссылка
	|ГДЕ
	|	ПалитраТоваровРМКСостав.Ссылка В(&МассивПалитр)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСтрокиПалитры.Палитра КАК Палитра,
	|	ПРЕДСТАВЛЕНИЕ(втСтрокиПалитры.Палитра) КАК ПалитраПредставление,
	|	втСтрокиПалитры.НомерСтроки КАК НомерСтроки,
	|	втСтрокиПалитры.ВложеннаяПалитра КАК ВложеннаяПалитра,
	|	втСтрокиПалитры.Номенклатура КАК Номенклатура,
	|	ПРЕДСТАВЛЕНИЕ(втСтрокиПалитры.Номенклатура) КАК НоменклатураПредставление,
	|	втСтрокиПалитры.Характеристика КАК Характеристика,
	|	втСтрокиПалитры.НомерКатегории КАК НомерКатегории,
	|	втСтрокиПалитры.НомерКатегорииРазмещения КАК НомерКатегорииРазмещения,
	|	втСтрокиПалитры.ЦветШрифта КАК ЦветШрифта,
	|	втСтрокиПалитры.ЦветФона КАК ЦветФона,
	|	втСтрокиПалитры.ЭтоКатегория КАК ЭтоКатегория,
	|	втСтрокиПалитры.ЭтоПалитра КАК ЭтоПалитра,
	|	втСтрокиПалитры.ИмяЭлемента КАК ИмяЭлемента,
	|	втСтрокиПалитры.Изображение КАК Изображение,
	|	ЕСТЬNULL(ПалитраТоваровРМКПрисоединенныеФайлы.Представление, """") КАК ИзображениеПредставление,
	|	втСтрокиПалитры.ВидМодификатора КАК ВидМодификатора,
	|	втСтрокиПалитры.Упаковка КАК Упаковка,
	|	втСтрокиПалитры.СкрыватьОстаток КАК СкрыватьОстаток,
	|	втСтрокиПалитры.ПустаяОбласть КАК ПустаяОбласть,
	|	втСтрокиПалитры.КартинкаПоУмолчанию КАК КартинкаПоУмолчанию
	|ИЗ
	|	втСтрокиПалитры КАК втСтрокиПалитры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПалитраТоваровРМКПрисоединенныеФайлы КАК ПалитраТоваровРМКПрисоединенныеФайлы
	|		ПО втСтрокиПалитры.Изображение = ПалитраТоваровРМКПрисоединенныеФайлы.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Палитра,
	|	НомерСтроки";
	ЗапросДанных.УстановитьПараметр("МассивПалитр", НаборПалитр.ВыгрузитьЗначения());
	Если ТекущийВариант = ИмяВариантаСЦеной Тогда
		
		РазделительЗапросов = "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";

		ЗапросДанных.Текст = СтрШаблон("%1%2%3", ЗапросДанных.Текст, РазделительЗапросов, ТекстЗапросаЦен);
		ЗапросДанных.УстановитьПараметр("ДатаОтчета", ДатаОтчета);
		Для Каждого ПараметрЗапроса Из ПараметрыЗапросаЦен Цикл
			ЗапросДанных.УстановитьПараметр(ПараметрЗапроса.Значение, ЭтотОбъект[ПараметрЗапроса.Значение]);
		КонецЦикла;
		
	КонецЕсли;
	РезультатПакетаЗапросов = ЗапросДанных.ВыполнитьПакет();
	
	Если ТекущийВариант = ИмяВариантаСЦеной Тогда
		ТаблицаЦен = РезультатПакетаЗапросов[НомерОсновнойТаблицы + СмещениеДляТаблицыЦен].Выгрузить();
		РезультатФункции.Вставить("ЦеныНоменклатуры", ТаблицаЦен);
	КонецЕсли;
	
	ТаблицаСтрокПалитры = РезультатПакетаЗапросов[НомерОсновнойТаблицы].Выгрузить();
	РезультатФункции.Вставить("СтрокиПалитры", ТаблицаСтрокПалитры);
	
	Возврат РезультатФункции;
	
КонецФункции

&НаСервере
Процедура УстановитьНастраиваемыеКолонки()
	
	НастраиваемыеКолонки.Добавить("Палитра", НСтр("ru = 'Палитра'"), Истина);
	НастраиваемыеКолонки.Добавить("Номенклатура", НСтр("ru = 'Номенклатура'"), Истина);
	НастраиваемыеКолонки.Добавить("Характеристика", НСтр("ru = 'Характеристика'"), Истина);
	НастраиваемыеКолонки.Добавить("Упаковка", НСтр("ru = 'Упаковка'"), Истина);
	НастраиваемыеКолонки.Добавить("Изображение", НСтр("ru = 'Изображение'"), Истина);
	НастраиваемыеКолонки.Добавить("ЦветШрифта", НСтр("ru = 'Цвет шрифта'"), Истина);
	НастраиваемыеКолонки.Добавить("ЦветФона", НСтр("ru = 'Цвет фона'"), Истина);
	НастраиваемыеКолонки.Добавить("СкрыватьОстаток", НСтр("ru = 'Скрывать остаток'"), Истина);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьПервоначальноеЗаполнение()
	
	Палитра = Параметры.Палитра;
	ДатаОтчета = ТекущаяДатаСеанса();
	
	УстановитьНастраиваемыеКолонки();
	
	СформироватьПриЗапуске = Истина;
	ВходнойВариант = Элементы.ТекущийВариант.СписокВыбора.НайтиПоЗначению(Параметры.ВариантОтчета);
	Если Не ВходнойВариант = Неопределено Тогда
		ТекущийВариант = ВходнойВариант.Значение;
		Если ВходнойВариант.Значение = ИмяВариантаСЦеной Тогда
			Элементы.ГруппаВариантСЦеной.Видимость = Истина;
			РезультатПроверки = ПараметрыОтчетаЗаполнены(ЭтотОбъект);
			СформироватьПриЗапуске = РезультатПроверки.Успех;
		КонецЕсли;
	Иначе
		ТекущийВариант = Элементы.ТекущийВариант.СписокВыбора.Получить(0).Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаборПалитр()
	
	НаборПалитр.Очистить();
	Если ЗначениеЗаполнено(Палитра) Тогда
		
		КорневыеПалитры = Новый Массив;
		КорневыеПалитры.Добавить(Палитра);
		ВложенныеПалитры = ИнтерфейсРМКСлужебный.ПолучитьВложенныеПалитры(КорневыеПалитры);
		НаборПалитр.ЗагрузитьЗначения(ВложенныеПалитры);
		НаборПалитр.Добавить(Палитра);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиКолонок()
	
	СтруктураХранения = ХранилищеОбщихНастроек.Загрузить(ЭтотОбъект.ИмяФормы);
	Если ТипЗнч(СтруктураХранения) = Тип("Структура") Тогда
		Если СтруктураХранения.Свойство("СохранятьНастройки") Тогда
			СохранятьНастройкиКолонок = СтруктураХранения.СохранятьНастройки;
			Если СохранятьНастройкиКолонок Тогда
				ПеренестиНастройкиКолонок(СтруктураХранения);
			КонецЕсли;
		КонецЕсли;
	Иначе
		СохранятьНастройкиКолонок = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПеренестиНастройкиКолонок(СтруктураХранения)
	
	КолонкиИзНастроек = Неопределено;
	Если СтруктураХранения.Свойство("СписокКолонок", КолонкиИзНастроек) Тогда
		КоличествоСохраненныхКолонок = КолонкиИзНастроек.Количество();
		ИндексЗначения = 0;
		Пока ИндексЗначения < КоличествоСохраненныхКолонок Цикл
			ТекущаяПозиция = КоличествоСохраненныхКолонок - ИндексЗначения - 1;
			ЭлементКолонка = КолонкиИзНастроек.Получить(ТекущаяПозиция);
			Если НастраиваемыеКолонки.НайтиПоЗначению(ЭлементКолонка.Значение) = Неопределено Тогда
				КолонкиИзНастроек.Удалить(ТекущаяПозиция);
			КонецЕсли;
			
			ИндексЗначения = ИндексЗначения + 1;
		КонецЦикла;
		
		КоличествоСохраненныхКолонок = КолонкиИзНастроек.Количество();
		ИндексЗначения = 0;
		Пока ИндексЗначения < КоличествоСохраненныхКолонок Цикл
			ЭлементИзХранилища = КолонкиИзНастроек.Получить(ИндексЗначения);
			ЭлементКолонкаОтчета = НастраиваемыеКолонки.НайтиПоЗначению(ЭлементИзХранилища.Значение);
			ЭлементКолонкаОтчета.Пометка = ЭлементИзХранилища.Пометка;
			ТекущаяПозиция = НастраиваемыеКолонки.Индекс(ЭлементКолонкаОтчета);
			Смещение = ИндексЗначения - ТекущаяПозиция;
			Если Смещение <> 0 Тогда
				НастраиваемыеКолонки.Сдвинуть(ЭлементКолонкаОтчета, Смещение);
			КонецЕсли;
			
			ИндексЗначения = ИндексЗначения + 1;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьНастройкиКолонок(ИмяФормы, СохранятьНастройки, КолонкиДляСохранения)
	
	СтруктураХранения = Новый Структура();
	СтруктураХранения.Вставить("СохранятьНастройки", СохранятьНастройки);
	
	СписокКолонок = Новый СписокЗначений;
	Если СохранятьНастройки Тогда
		СписокКолонок = КолонкиДляСохранения.Скопировать();
	КонецЕсли;
	СтруктураХранения.Вставить("СписокКолонок", СписокКолонок);
	
	ХранилищеОбщихНастроек.Сохранить(ИмяФормы, , СтруктураХранения);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиКолонокПриНеобходимости()
	
	Если МодифицированностьНастроек Тогда
		СохранитьНастройкиКолонок(ЭтотОбъект.ИмяФормы, СохранятьНастройкиКолонок, НастраиваемыеКолонки);
		МодифицированностьНастроек = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
